Цель: Научиться работать с open CV
	Научиться работать с Git Bush
OpenCV - Open Source Computer Vision Library
библиотека постоянно обновляется, и добовляется пользователями
Позволяет:
Фильтрация
Преобразование
Читает и видео и изобрвжение

Изображение хранится в матрице
столбец матрици или строка - vector

Нужно объявить матрицу, чтобы добавить изображение  cv::Mat img;


Задание 1
нахождение контуров изображения
пункт0
создание проекта с openCV
скрин окна
скрин текста
пункт1
скачать изображение и сохранить его в папку проекта
скрин картинкии
пункт2
использовать функцию imread() загрузить изображение Добавить код
пункт3
обработать изображение функции cvtColor(), blur(), Canny().Используя функцию imwrite() сохранить изображение
пункт4
найти контуры findContours()
вывести контуры drowConturs()
для этого найти координаты центра масс
сохранить
токен
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

Теория про оператор Canny
1 преобразование в чёрно-белый rgb2gray
2 blur() оператор сглаживания
  оператор гауса
3 пороговая фильтрация (берём значение яркости одного пиксиля оно лежит в интервала 0(чёрный) до 255(белый))
   что бы определить к какой границе отнести пиксили нужно определить пороговое значение: его может задать пользователь или определить автоматически с помощью treshold 
4 передали градиент - рисунт вместо каждого пиксиля срелочку
5 вектор это тип данных, который позволяет хранить координаты (xн;yн  xк;yк) есть вектор моментов его использование позволяет определить нулевой момент записывается как "mu[i].m00" (кол-во точек в контуре)
  первый момент записывается как "mu[i].m10" "mu[i].m01"(кол-во)
6 рефакторинг - улучшение читаемости кода путём его переписывания, не меняя функциональность
7 функция - это отдельный блок кода позволяет использовать ранее написанный код. 
   вызов функии это имя ф-ции и в скобках аргменты
   что бы написать ф-цию указываем: тип данных имя (тип данных аргумента имя аргумента)
   {
   
   }
  
